org/blog/2021/ssh-agent-kde.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: KDE 开机自启 ssh agent，加载密匙

1. [[https://wiki.archlinux.org/title/KDE_Wallet#Using_the_KDE_Wallet_to_store_ssh_key_passphrases][Using the KDE Wallet to store ssh key passphrases]]
2. [[https://dev.to/manekenpix/kde-plasma-ssh-keys-111e][KDE Plasma & ssh keys]]

[[https://userbase.kde.org/KDE_Wallet_Manager][Kwallet]] 是 Linux 桌面管理器 KDE 下的一款管理密码的应用。

* Kwallet

创建一个新钱包，并为它设置密码。

* 开机启动 ssh-agent

确保安装了 [[https://github.com/KDE/ksshaskpass][Ksshaskpass]]。

新建文件 =~/.config/plasma-workspace/env/ssh-agent-startup.sh= ：

#+BEGIN_SRC sh
#!/bin/sh

eval "$(ssh-agent -s)"
#+END_SRC

通过 KDE 的系统设置中 Autostart 设置， =Add Login Script= 。添加新建的这个文件，之后会自动生成文件 =~/.config/autostart/ssh-agent-startup.sh.desktop= 。

不要忘记让 Shell 文件可执行：

#+BEGIN_SRC sh
sudo chmod +x ~/.config/plasma-workspace/env/ssh-agent-startup.sh
#+END_SRC

* 开机添加 ssh 密匙

新建文件 =~/.config/autostart/ssh-add.desktop= ：

#+BEGIN_SRC conf
[Desktop Entry]
Exec=ssh-add ~/.ssh/key
Name=ssh-add
Type=Application
#+END_SRC

* 环境变量与普通应用

启动 ssh agent 要比添加 ssh 密匙提前。因为前者使用的是环境变量，后者使用的只是普通应用自启动。