blog/2021/ssh-agent-kde.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 19:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDE 开机自启 ssh agent，加载密匙</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">KDE 开机自启 ssh agent，加载密匙</h1>
</header><ol class="org-ol">
<li><a href="https://wiki.archlinux.org/title/KDE_Wallet#Using_the_KDE_Wallet_to_store_ssh_key_passphrases">Using the KDE Wallet to store ssh key passphrases</a></li>
<li><a href="https://dev.to/manekenpix/kde-plasma-ssh-keys-111e">KDE Plasma &amp; ssh keys</a></li>
</ol>

<p>
<a href="https://userbase.kde.org/KDE_Wallet_Manager">Kwallet</a> 是 Linux 桌面管理器 KDE 下的一款管理密码的应用。
</p>

<div id="outline-container-org44ce420" class="outline-2">
<h2 id="org44ce420">Kwallet</h2>
<div class="outline-text-2" id="text-org44ce420">
<p>
创建一个新钱包，并为它设置密码。
</p>
</div>
</div>

<div id="outline-container-org0b6903c" class="outline-2">
<h2 id="org0b6903c">开机启动 ssh-agent</h2>
<div class="outline-text-2" id="text-org0b6903c">
<p>
确保安装了 <a href="https://github.com/KDE/ksshaskpass">Ksshaskpass</a>。
</p>

<p>
新建文件 <code>~/.config/plasma-workspace/env/ssh-agent-startup.sh</code> ：
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #706565;">#</span><span style="color: #857575;">!/bin/</span><span style="color: #91a0b3;">sh</span>

<span style="color: #9fbfdf;">eval</span> <span style="color: #ddbc91;">"$(ssh-agent -s)"</span>
</pre>
</div>

<p>
通过 KDE 的系统设置中 Autostart 设置， <code>Add Login Script</code> 。添加新建的这个文件，之后会自动生成文件 <code>~/.config/autostart/ssh-agent-startup.sh.desktop</code> 。
</p>

<p>
不要忘记让 Shell 文件可执行：
</p>

<div class="org-src-container">
<pre class="src src-sh">sudo chmod +x ~/.config/plasma-workspace/env/ssh-agent-startup.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-orga148d01" class="outline-2">
<h2 id="orga148d01">开机添加 ssh 密匙</h2>
<div class="outline-text-2" id="text-orga148d01">
<p>
新建文件 <code>~/.config/autostart/ssh-add.desktop</code> ：
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #ad8572;">Desktop Entry</span>]
<span style="color: #aaca86;">Exec</span>=ssh-add ~/.ssh/key
<span style="color: #aaca86;">Name</span>=ssh-add
<span style="color: #aaca86;">Type</span>=Application
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd12b69b" class="outline-2">
<h2 id="orgd12b69b">环境变量与普通应用</h2>
<div class="outline-text-2" id="text-orgd12b69b">
<p>
启动 ssh agent 要比添加 ssh 密匙提前。因为前者使用的是环境变量，后者使用的只是普通应用自启动。</p>
</div>
</div>
</div>
</body>
</html>